export const InputFilterAsWhiteSpace =
  /[^\wㄱ-ㅎㅏ-ㅣ가-힣!@#$%^&*(),.?":{}|<>\n\s]/g;

export const InputFilterAsSpace = /[^\wㄱ-ㅎㅏ-ㅣ가-힣!@#$%^&*(),.?":{}|<>\s]/g;

export const SwearWordsFilter =
  /시발|씨발|ㅅㅂ|ㅆㅂ|ㅆㅃ|병신|ㅄ|ㅂㅅ|ㅈㄹ|ㅅㅅ|좆|창녀|보지|후장|개새|미친|새끼|좆까|빠가|섹스|보유|따먹|노무|조선|일베|개소리|개같|젖밥|젖탱이|섹폰|유두|항문|암캐|변태|걸레|느금|건전지|찐따|미카|틀딱|디져라|좆나|존못|지랄|쌍년|싸가지|섹트|염병|씹년|꼴통|애자|돌은|강간|무상|살인|낙태|술래잡기|잠자|따까리|성기|보슬아치|꺼져|염병|노무현|십장생|피스|빨갱이|김치녀|좆도|페미니즘|귀두|노예|새꺄|씨이발|쌍놈|자식|시발년|보지년|오더|퇴장|퇴각|씹물|암내|욕조|빨아대|잠지|떠라|존트|애비|씹쓰레기|씹덕|그지새끼|맘충|뒤져라|보빨|새퀴|삼류|벼엉신|엿|새꺄|지잡|미친년|미친놈|미친새끼|좆밥|보지밥|엠창|저능아|느금마|김치년|씹보지|빨통|개씹|개좆|개보지|보지좆|좆보지|창년아|보지냐|씨부럴|자지냐|씨1발|꼬추 /g;
